In [1]:
#there are two new datatype in pandas: Series (like dictionary) and Dataframe (like 2D table)

In [4]:
import pandas as pd
my = pd.Series([4, 7, -5, 3])
print(my.values)
print(my.index)

[ 4  7 -5  3]
RangeIndex(start=0, stop=4, step=1)

In [5]:
mi = pd.Series([4, 7, -5, 3], index = ['a', 'b', 'c', 'e'])
mi['b']

7

In [6]:
# from dict to Series

In [9]:
dic = {'ad':888 , '9322': 'asd'}
Sdic = pd.Series(dic)
Sdic['ad']

888

In [10]:
# dataframe has index(有幾橫行) and column(幾直行)

In [11]:
data = {'name': ['Bob', 'Nancy','Amy','Elsa','Jack'],
        'year': [1996, 1997, 1997, 1996, 1997],
        'month': [8, 8, 7, 1, 12],
        'day':[11,23,8,3,11]}
myframe = pd.DataFrame(data)
myframe

    name  year  month  day
0    Bob  1996      8   11
1  Nancy  1997      8   23
2    Amy  1997      7    8
3   Elsa  1996      1    3
4   Jack  1997     12   11

In [12]:
# change column position
myframe2 = pd.DataFrame(data,columns=['name','day', 'month', 'year'])

In [15]:
#add column
luckynumber = ['3','2','1','7','8']
luckynumber = pd.Series(luckynumber)
myframe2 = pd.DataFrame(data,columns=['name','day', 'month', 'year', 'luckynumber'])
myframe2['luckynumber']=luckynumber

In [16]:
myframe2

    name  day  month  year luckynumber
0    Bob   11      8  1996           3
1  Nancy   23      8  1997           2
2    Amy    8      7  1997           1
3   Elsa    3      1  1996           7
4   Jack   11     12  1997           8

In [17]:
# advanced use
# https://ithelp.ithome.com.tw/articles/10194006